app/Helpers/Helper.php

select * from `role_has_permissions` where `role_id` = '2'
---
    public static function checkPermission($permissionName=0){
        if(Auth::user()->user_type == "superadmin"){
            return true;
        }else{
            $user = Auth::user();
            $role = RoleHasPermissions::with('permission')->where('role_id','=',$user->role_id)->get();